#Generated by Fabric Compiler ( version 2018.2 <build 39708> ) at Mon Apr  8 11:13:16 2019

add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/i2c_master/i2c_config.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/i2c_master/i2c_master_bit_ctrl.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/i2c_master/i2c_master_byte_ctrl.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/i2c_master/i2c_master_top.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/aq_axi_master.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/cmos_8_16bit.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/cmos_write_req_gen.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/color_bar.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/frame_fifo_read.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/frame_fifo_write.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/frame_read_write.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/lut_ov5640_rgb565_1024_768.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/top.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/video_define.v"
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/video_timing_data.v"
add_design D:/example_ziguang/ddr3_ov5640_hdmi/ipcore/clk_200M/inst.idf
add_design D:/example_ziguang/ddr3_ov5640_hdmi/ipcore/video_pll/inst.idf
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
add_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/i2c_master/i2c_master_defines.v"
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
add_constraint "D:/example_ziguang/ddr3_ov5640_hdmi/ov5640.pcf"
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
dev_map 
remove_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/aq_axi_master.v"
remove_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/frame_read_write.v"
remove_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/frame_fifo_read.v"
remove_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/frame_fifo_write.v"
remove_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/video_timing_data.v"
remove_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/color_bar.v"
remove_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/video_define.v"
remove_design -verilog "D:/example_ziguang/ddr3_ov5640_hdmi/source/i2c_master/i2c_master_defines.v"
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
add_constraint -logic -fdc "D:/example_ziguang/ddr3_ov5640_hdmi/ddr3_ov5640_hdmi.fdc"
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
add_fic "D:/example_ziguang/ddr3_ov5640_hdmi/synthesize/top.fic"
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
report_timing 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/dvi_tx/dvi_encoder.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/dvi_tx/encode.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/dvi_tx/serdes_4b_10to1.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/aq_axi_master.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/color_bar.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/frame_fifo_read.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/frame_fifo_write.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/frame_read_write.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/video_timing_data.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/sources_1/video_define.v"
add_design D:/example_ziguang/ddr3_ov5640_hdmi/source/ddr3/inst.idf
remove_design D:/example_ziguang/ddr3_ov5640_hdmi/source/ddr3/inst.idf
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/rtl/ipsl_ddrc_apb_reset.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/rtl/ipsl_ddrc_reset_ctrl.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/rtl/ipsl_ddrphy_dll_update_ctrl.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/rtl/ipsl_ddrphy_reset_ctrl.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/rtl/ipsl_ddrphy_training_ctrl.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/rtl/ipsl_ddrphy_update_ctrl.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/rtl/ipsl_hmemc_ddrc_top.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/rtl/ipsl_hmemc_phy_top.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/rtl/ipsl_phy_io.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/pll/pll_50_400.v"
add_design "D:/example_ziguang/ddr3_ov5640_hdmi/source/ddr3/ddr3.v"
add_design D:/example_ziguang/ddr3_ov5640_hdmi/ipcore/afifo_16i_64o_512/inst.idf
add_design D:/example_ziguang/ddr3_ov5640_hdmi/ipcore/afifo_64i_16o_128/inst.idf
remove_fic "D:/example_ziguang/ddr3_ov5640_hdmi/synthesize/top.fic"
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
pnr -mode "fast" -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -mode "fast" -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
pnr -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
pnr -mode "fast" 
report_timing 
gen_bit_stream 
pnr -mode "fast" -optimize_multi_corner_timing 
report_timing 
gen_bit_stream 
pnr -plc_decongestion 5 -fast_router false -mode "fast" -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
pnr -plc_decongestion 2 -mode "fast" -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -mode "fast" -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
pnr -fast_router false -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
pnr -plc_decongestion 2 -fast_router false -mode "fast" -fix_hold_violation 
report_timing 
report_power 
gen_bit_stream 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
report_power 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -7 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
add_design "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/cmos_capture_data.v"
add_design "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/i2c_dri.v"
add_design "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/i2c_ov5640_rgb565_cfg.v"
add_design "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/ov5640_rgb565_1024x768_vga.v"
remove_design -verilog "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/ov5640_rgb565_1024x768_vga.v"
remove_design -verilog "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/cmos_capture_data.v"
remove_design -verilog "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/i2c_dri.v"
remove_design -verilog "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/i2c_ov5640_rgb565_cfg.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
add_design "D:/astudy/FPGA_ziguang/CD/demo/13_ddr3_ov5640_hdmi/source/sources_1/i2c_dri.v"
add_design "D:/astudy/FPGA_ziguang/CD/demo/13_ddr3_ov5640_hdmi/source/sources_1/i2c_ov5640_rgb565_cfg.v"
add_design "D:/astudy/FPGA_ziguang/CD/demo/13_ddr3_ov5640_hdmi/source/sources_1/ov5640_rgb565_1024x768_vga.v"
remove_design -force -verilog "D:/astudy/FPGA_ziguang/CD/demo/13_ddr3_ov5640_hdmi/source/sources_1/ov5640_rgb565_1024x768_vga.v"
add_design "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/i2c_dri.v"
add_design "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/i2c_ov5640_rgb565_cfg.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
remove_design -verilog "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/i2c_ov5640_rgb565_cfg.v"
remove_design -verilog "D:/BaiduNetdiskDownload/1_Verilog/31_ov5640_rgb565_1024x768_vga/rtl/i2c_dri.v"
add_design "D:/astudy/FPGA_ziguang/FPGA_CODE/ov5640/i2c_dri.v"
add_design "D:/astudy/FPGA_ziguang/FPGA_CODE/ov5640/i2c_ov5640_rgb565_cfg.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
add_design "D:/astudy/FPGA_ziguang/CD/demo/13_ddr3_ov5640_hdmi/source/i2c_master/i2c_master_defines.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
remove_design -verilog "D:/astudy/FPGA_ziguang/FPGA_CODE/ov5640/i2c_dri.v"
remove_design -verilog "D:/astudy/FPGA_ziguang/FPGA_CODE/ov5640/i2c_ov5640_rgb565_cfg.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
add_design "C:/Users/Dande/Desktop/13_ddr3_ov5640_hdmi/source/Dynamo/clk_5hz.v"
add_design "C:/Users/Dande/Desktop/13_ddr3_ov5640_hdmi/source/Dynamo/clk_10hz.v"
add_design "C:/Users/Dande/Desktop/13_ddr3_ov5640_hdmi/source/Dynamo/Controller.v"
add_design "C:/Users/Dande/Desktop/13_ddr3_ov5640_hdmi/source/Dynamo/Count_pulse.v"
add_design "C:/Users/Dande/Desktop/13_ddr3_ov5640_hdmi/source/Dynamo/Frequency_divider_dynamic_scanning.v"
add_design "C:/Users/Dande/Desktop/13_ddr3_ov5640_hdmi/source/Dynamo/keyboard_buffer.v"
add_design "C:/Users/Dande/Desktop/13_ddr3_ov5640_hdmi/source/Dynamo/keyboard_encoder.v"
add_design "C:/Users/Dande/Desktop/13_ddr3_ov5640_hdmi/source/Dynamo/Nixie_Light_Display.v"
add_design "C:/Users/Dande/Desktop/13_ddr3_ov5640_hdmi/source/Dynamo/Pulse.v"
add_design "C:/Users/Dande/Desktop/13_ddr3_ov5640_hdmi/source/Dynamo/pulse_zhuanghuan.v"
add_design "C:/Users/Dande/Desktop/13_ddr3_ov5640_hdmi/source/Dynamo/seven_decode_control.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -mode "fast" -fix_hold_violation 
report_timing 
gen_bit_stream 
